<?php
/**
 * Created by PhpStorm.
 * User: patriot
 * Date: 9/8/17
 * Time: 2:08 AM
 */

require_once  dirname(__FILE__)."/../lib/PPersianRender.php";

$message = "در سال ۲۰۳۵ درست ۱۹ سال بعد کسی در یک کنفرانس نرم‌افزاری سخنرانی‌ای مثل این خواهد کرد. «سلام، من ۴۲ سال دارم و این داستان من است». امیدوارم  ❌ یکی از شما این سخنرانی را کند و گرنه لابد یک بات هوش مصنوعی این کار را خواهد کرد. در این سخنرانی گزارشی از وقایع سال ۲۰۱۶ خواهید داد. مثلا این که ۲۰۱۶ سالی بود که David Bowie، Umberto Eco، Gato Barbieri و Johan Cruyff در گذشتند یا SQL Server برای اولین بار روی لینوکس ارايه شد یا Google AlphaGo برای اولین بار یک قهرمان Go را شکست داد یا اسناد پاناما و دیتابیس اطلاعات شهروندی ترکیه در یک روز درز کردند یا گوگل امکان استفاده از Swift روی اندروید را بررسی کرد یا این که آخرین سالی بود که مردم چیز به درد نخوری به اسم حریم خصوصی داشتند. ۳ سال با مشکل سال ۲۰۳۸ فاصله خواهیم داشت و لابد مردم به خاطر آن نگران و عصبی خواهند بود. البته من نمی‌دانم تا ۱۹ سال دیگر چه اتفاقاتی خواهد افتاد اما می‌توانم به شما بگویم این سه اتفاق حتما خواهند افتاد.";
$text = \FaGD\PPersianRender::render($message,true); //Reversed text for GD

print 'Original String:'.PHP_EOL.$message.PHP_EOL;
print 'Converted String:'.PHP_EOL.$text;